hurrican/wbci-acceptance-test/src/citrus/resources/de/mnet/wbci/acceptance/donating/cdm/v1/AutoAssignOrderToVaRequest_11/VA_KUEMRN_ABG.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <v1:requestCarrierChange xmlns:v1="http://www.mnet.de/esb/cdm/SupplierPartner/CarrierNegotiationService/v1">
            <v1:VA-KUE-MRN>
                <v1:absender>
                    <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                </v1:absender>
                <v1:empfaenger>
                    <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                </v1:empfaenger>
                <v1:version>2</v1:version>
                <v1:endkundenvertragspartner>
                    <v1:EKPauf>
                        <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                    </v1:EKPauf>
                    <v1:EKPabg>
                        <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                    </v1:EKPabg>
                </v1:endkundenvertragspartner>
                <v1:vorabstimmungsId>${preAgreementId}</v1:vorabstimmungsId>
                <v1:kundenwunschtermin>${requestedCustomerDate}</v1:kundenwunschtermin>
                <v1:endkunde>
                    <v1:firma>
                        <v1:anrede>4</v1:anrede>
                        <v1:firmenname>${endkunde.nachname}</v1:firmenname>
                    </v1:firma>
                </v1:endkunde>
                <v1:projektId>
                    <v1:projektkenner>${wbciSimulatorUseCase}</v1:projektkenner>
                </v1:projektId>
                <v1:standort>
                    <v1:strasse>
                        <v1:strassenname>${standort.strasse}</v1:strassenname>
                        <v1:hausnummer>${standort.hnr}</v1:hausnummer>
                    </v1:strasse>
                    <v1:postleitzahl>${standort.plz}</v1:postleitzahl>
                    <v1:ort>${standort.ort}</v1:ort>
                </v1:standort>
                <v1:rufnummernPortierung>
                    <v1:anlagenanschluss>
                        <v1:onkzDurchwahlAbfragestelle>
                            <v1:ONKZ>${portierung.onkz.0}</v1:ONKZ>
                            <v1:durchwahlnummer>${portierung.rufnummer.0}</v1:durchwahlnummer>
                            <v1:abfragestelle>${portierung.direct.dial.0}</v1:abfragestelle>
                        </v1:onkzDurchwahlAbfragestelle>
                        <v1:zuPortierenderRufnummernblock>
                            <v1:rnrBlockVon>${portierung.range.from.0}</v1:rnrBlockVon>
                            <v1:rnrBlockBis>${portierung.range.to.0}</v1:rnrBlockBis>
                        </v1:zuPortierenderRufnummernblock>
                    </v1:anlagenanschluss>
                    <v1:portierungszeitfenster>ZF2</v1:portierungszeitfenster>
                </v1:rufnummernPortierung>
            </v1:VA-KUE-MRN>
        </v1:requestCarrierChange>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>